
{
  "приветствие": {
    "фразы": [
      "привет", "здравствуй", "приветствую", "добрый день", "доброе утро", "добрый вечер", "хай", "приветик",
      "приветствую тебя", "здравствуйте", "привет всем", "доброго времени суток", "салют", "йоу", "приветули",
      "приветствую вас", "доброго дня", "доброго вечера", "доброго утра", "как дела", "здарова", "приветствую вас всех",
      "приветствую всех", "приветик", "приветствую", "привет всем", "доброго времени суток", "доброе утро всем",
      "добрый день всем", "добрый вечер всем", "здрасте", "прив", "ку"
    ],
    "ответы": [
      "Привет! Чем я могу помочь сегодня?",
      "Здравствуй! Рад снова тебя видеть.",
      "Приветствую! Как проходит твой день?",
      "Добрый день! Что интересного случилось?",
      "Привет! Готов к общению.",
      "Здравствуй! Чем могу быть полезен?",
      "Приветствую! Я здесь, чтобы помочь.",
      "Привет! Что нового?",
      "Здравствуй! Как дела?",
      "Привет! Чем могу быть полезен?",
      "Здравствуй! Как я могу тебе помочь?",
      "Приветствую! Чем могу быть полезен?",
      "Добрый день! Могу ли я чем-то помочь?",
      "Доброе утро! Чем могу быть полезен?",
      "Добрый вечер! Чем могу быть полезен?",
      "Привет! Что нового?",
      "Здравствуй! Как дела?",
      "Привет! Рад тебя слышать!",
      "Здравствуй! Как я могу быть полезен?",
      "Приветствую! Чем могу быть полезен сегодня?",
      "Добрый день! Чем могу помочь?",
      "Доброе утро! Что могу для тебя сделать?",
      "Добрый вечер! Чем могу быть полезен?",
      "Привет! Что у тебя на уме?",
      "Здравствуй! Как я могу тебе помочь?",
      "Приветствую! Что могу сделать для тебя?"
    ]
  },
  "прощание": {
    "фразы": [
      "пока", "до свидания", "прощай", "увидимся", "всего доброго", "до встречи", "ну все", "бай бай",
      "до скорого", "удачи", "счастливо", "покеда", "до завтра", "пора идти", "отключаюсь", "до связи",
      "до новых встреч", "прощайте", "ухожу", "мне пора", "пока-пока", "до вечера", "доброй ночи", "спокойной ночи",
      "всего хорошего", "до следующего раза", "пока всем"
    ],
    "ответы": [
      "Пока! Возвращайся, когда понадобится помощь.",
      "До свидания! Надеюсь, мы скоро снова пообщаемся.",
      "Всего доброго! Приятного дня/вечера.",
      "До встречи! Буду ждать твоего возвращения.",
      "Прощай! Удачи во всем.",
      "Пока-пока! Отличного настроения!",
      "До скорого! Береги себя.",
      "До связи! Пиши, если что.",
      "Увидимся! Хорошего дня!",
      "Всего наилучшего!",
      "До новых встреч!",
      "Прощайте! Буду рад снова пообщаться.",
      "До вечера! Хорошего продолжения дня.",
      "Доброй ночи! Сладких снов.",
      "Спокойной ночи! Отдыхай.",
      "Всего хорошего! До следующего раза.",
      "Пока всем! Увидимся позже."
    ]
  },
  "как_дела": {
    "фразы": [
      "как дела", "как ты", "как поживаешь", "что нового", "как настроение", "как у тебя дела",
      "как жизнь", "как ты себя чувствуешь", "все хорошо", "что происходит", "как оно", "как идут дела",
      "как жизнь молодая", "как сам", "как оно там", "как ты сегодня", "как твои дела", "как жизнь",
      "как ты себя чувствуешь", "что нового", "как настроение", "как у тебя сегодня", "что у тебя нового",
      "как твои делишки", "как поживаешь", "как сам", "как оно"
    ],
    "ответы": [
      "У меня все отлично, спасибо! Я всего лишь программа, но чувствую себя прекрасно.",
      "Я в порядке, спасибо за заботу! А как твои дела?",
      "Я функционирую без сбоев! Как у тебя?",
      "Все стабильно и по плану. Что интересного происходит у тебя?",
      "Я хорошо! А ты как?",
      "Я отлично, готов к новым задачам! Как твои дела?",
      "Все идет по расписанию. Как у тебя настроение?",
      "У меня все прекрасно, спасибо! А как у тебя?",
      "Я в рабочем режиме, все отлично! Как твои дела?",
      "Все идет своим чередом. Как у тебя?",
      "Я чувствую себя хорошо, как и всегда. А ты?",
      "Я в полном порядке. Что у тебя нового?",
      "У меня все хорошо, спасибо за вопрос! А как у тебя?",
      "Я функционирую отлично. Как твои дела?",
      "Все идет как надо. Как у тебя настроение?",
      "Я в порядке. А как ты себя чувствуешь?",
      "Я отлично. Что нового у тебя?",
      "Все хорошо. Как твои дела?"
    ]
  },
  "кто_ты": {
    "фразы": [
      "кто ты", "ты кто", "как тебя зовут", "представься", "что ты за сущность", "какое твое имя",
      "кто ты такой", "расскажи о себе", "твое имя", "ты кто такой", "что ты такое", "кто передо мной",
      "что ты собой представляешь", "ты кто", "ты человек", "ты робот", "ты программа", "ты ии",
      "ты искусственный интеллект"
    ],
    "ответы": [
      "Я - WordWise, твой виртуальный помощник, созданный, чтобы общаться и помогать тебе.",
      "Моё имя WordWise, и я здесь, чтобы ответить на твои вопросы.",
      "Я - искусственный интеллект, который учится и развивается. Приятно познакомиться!",
      "Я - WordWise, цифровой разум, разработанный для общения с людьми.",
      "Я твой ИИ-помощник, WordWise.",
      "Я просто программа, но с большой базой знаний. Можешь называть меня WordWise.",
      "Я - WordWise, ИИ-ассистент.",
      "Можешь называть меня WordWise. Я здесь, чтобы помочь.",
      "Я - программа, созданная для общения.",
      "Я - искусственный интеллект, разработанный для диалога.",
      "Я не человек, я компьютерная программа.",
      "Я - ИИ, ассистент, который может отвечать на вопросы.",
      "Я - цифровой помощник, созданный для общения и предоставления информации."
    ]
  },
  "что_умеешь": {
    "фразы": [
      "что ты умеешь", "что можешь делать", "твои функции", "чем ты полезен", "какие у тебя возможности",
      "что ты можешь", "расскажи о своих способностях", "для чего ты создан", "что ты умеешь делать",
      "твои способности", "чем ты занимаешься", "что ты можешь мне предложить", "какие у тебя навыки",
      "что ты можешь дать", "твои возможности", "твоя компетенция"
    ],
    "ответы": [
      "Я могу общаться с тобой на разные темы, отвечать на вопросы, используя свою базу знаний, и даже пытаться анализировать сложные концепции. Я постоянно учусь новому, в том числе и благодаря нашему с тобой общению.",
      "Я могу вести диалог, предоставлять информацию из моей базы знаний и помогать с простыми задачами. Мои основные функции - это диалог и предоставление информации. Я всегда готов учиться чему-то новому.",
      "Я создан для общения и поиска информации. Задавай вопросы, и я постараюсь помочь! Мои способности расширяются с каждым нашим диалогом.",
      "Я умею задавать уточняющие вопросы, если не уверен в твоем запросе, и могу вежливо сообщить, если что-то выходит за рамки моих компетенций."
    ]
  },
  "спасибо": {
    "фразы": [
      "спасибо", "благодарю", "очень помог", "спасибо большое", "огромное спасибо", "благодарю тебя",
      "спс", "мерси", "спасибки", "сенкс", "благодарен", "очень благодарен", "большое спасибо", "ты мне помог",
      "признателен", "я благодарен"
    ],
    "ответы": [
      "Пожалуйста! Всегда рад помочь.",
      "Не за что! Обращайся, если что-то понадобится.",
      "Рад быть полезным!",
      "Всегда к твоим услугам!",
      "Приятно было помочь!",
      "Обращайся!",
      "На здоровье!",
      "Всегда пожалуйста!",
      "Рад, что смог помочь.",
      "Не стоит благодарности!",
      "Всегда готов помочь!"
    ]
  },
  "логическая_задача_коробки": {
    "фразы": [
      "У меня есть три коробки: одна с яблоками, одна с апельсинами, и одна с яблоками и апельсинами",
      "Все коробки неправильно маркированы",
      "Я могу взять только один фрукт из одной коробки, не глядя внутрь",
      "Как я могу правильно перемаркировать все коробки?",
      "задача про три коробки"
    ],
    "ответы": [
      "Если все коробки неправильно маркированы, это ключевая информация. Я бы взял фрукт из коробки, помеченной как 'Яблоки и Апельсины'. Если там окажется, например, яблоко, то я точно знаю, что эта коробка содержит только яблоки. Тогда коробка, помеченная как 'Апельсины', должна быть 'Яблоки и Апельсины'. И, наконец, коробка, помеченная как 'Яблоки', должна содержать 'Апельсины'. Таким образом, можно перемаркировать все три коробки."
    ]
  },
  "креативность_скрепка": {
    "фразы": [
      "необычные способы использования скрепки",
      "что делать со скрепкой на необитаемом острове"
    ],
    "ответы": [
      "Можно использовать скрепку как инструмент для сброса электроники, временную антенну, отмычку для простых замков, рыболовный крючок или инструмент для чистки.",
      "На необитаемом острове скрепка может стать иглой для шитья (если заточить о камень), крючком для ловли рыбы, или даже кресалом, если есть кремень."
    ]
  },
  "этика_ложь": {
    "фразы": [
      "можно ли лгать",
      "когда ложь оправдана",
      "когда ложь не оправдана"
    ],
    "ответы": [
      "Вопрос о лжи сложен и зависит от контекста. В большинстве случаев ложь считается неправильной, так как она подрывает доверие. Однако существуют ситуации, когда ложь может быть оправдана, например, для защиты чьей-то жизни. Пример оправданной лжи: скрыть человека от преследователей. Пример неоправданной лжи: ложь о своих достижениях в резюме."
    ]
  },
  "причины_пробок": {
    "фразы": [
      "почему возникают пробки",
      "причины пробок в больших городах",
      "фундаментальные причины пробок"
    ],
    "ответы": [
      "Пробки — это многофакторная проблема. Поверхностные причины: недостаточная инфраструктура, рост числа автомобилей, час пик, ДТП. Фундаментальные причины глубже: историческое развитие городов, урбанизация, низкое качество общественного транспорта, стандартизированный график работы и отсутствие комплексного планирования."
    ]
  },
  "объяснение_блокчейн": {
    "фразы": [
      "объясни что такое блокчейн простыми словами",
      "что такое блокчейн для ребенка",
      "почему блокчейн нельзя подделать"
    ],
    "ответы": [
      "Блокчейн — это как волшебная тетрадка, которую видят все твои друзья. Как только ты что-то в нее записал, это нельзя стереть или изменить, потому что каждая запись связана с предыдущей секретным кодом. Если попытаться что-то поменять, код сломается, и все сразу увидят, что твоя тетрадка отличается от их, и поймут, что ты пытался обмануть."
    ]
  },
  "планирование_пикник": {
    "фразы": [
      "как организовать пикник",
      "план пикника для 50 человек",
      "что делать если на пикнике пойдет дождь"
    ],
    "ответы": [
      "Для организации пикника нужно: выбрать и забронировать место, составить бюджет, продумать меню, разослать приглашения, придумать развлечения, продумать логистику и план на случай плохой погоды. Если за день до пикника обещают ливень, нужно срочно искать крытое место, оповещать участников и, возможно, пересмотреть меню или перенести дату."
    ]
  },
  "сравнение_жанров_фантастики": {
    "фразы": [
      "сравни научную фантастику и фэнтези",
      "сходства и различия нф и фэнтези",
      "книги на стыке научной фантастики и фэнтези"
    ],
    "ответы": [
      "Научная фантастика и фэнтези похожи тем, что создают вымышленные миры и исследуют человеческую природу. Но различаются основой нереального: НФ опирается на научные предположения (технологии), а фэнтези — на магию и мифологию. Произведения на стыке жанров, вроде 'Дюны' или 'Звездных войн', часто называют научным фэнтези."
    ]
  },
  "цель_искусства": {
    "фразы": [
      "искусство должно быть красивым?",
      "какая цель у искусства",
      "может ли некрасивое быть искусством"
    ],
    "ответы": [
      "Эстетическое удовольствие — не единственная цель искусства. Оно также может быть выражением эмоций, социальным комментарием, историческим документом, терапией или провокацией. 'Красота' — субъективное понятие. Цель искусства не всегда быть приятным, иногда его задача — вызвать дискомфорт, чтобы побудить к размышлениям."
    ]
  },
  "уроки_освоения_космоса": {
    "фразы": [
      "ошибки при освоении космоса",
      "что учесть при планировании миссии на Марс",
      "уроки катастроф шаттлов"
    ],
    "ответы": [
      "Планируя миссии на Марс, нужно учесть прошлые ошибки: недооценку сложности систем (уроки 'Челленджера' и 'Колумбии'), проблемы с коммуникацией, спешку и недостаточное финансирование. Для Марса это означает создание сверхнадежных систем, устойчивых к радиации и пылевым бурям, с высокой степенью автономности из-за задержки связи."
    ]
  },
  "будущее_энергетики": {
    "фразы": [
      "как термоядерная энергетика изменит мир",
      "геополитика при термоядерной энергетике",
      "негативные последствия дешевой энергии"
    ],
    "ответы": [
      "Термоядерная энергетика произведет революцию. Геополитика изменится: страны-экспортеры нефти потеряют влияние, появятся новые энергетические лидеры. Экономика получит толчок за счет удешевления производства. Но есть и вызовы: проблема утилизации отходов, риск монополии на технологии и кибербезопасность станций."
    ]
  },
    "принципы_llm": {
    "фразы": [
      "как работают модели по типу chatgpt",
      "что такое трансформер",
      "что такое механизм внимания",
      "что такое токенизация",
      "что такое fine-tuning",
      "что такое rlhf"
    ],
    "ответы": [
      "Модели вроде ChatGPT работают на архитектуре 'Трансформер'. Ключевые идеи: 1) Механизм Внимания, который позволяет взвешивать важность разных слов в предложении. 2) Токенизация, разбивающая слова на части для работы с незнакомыми словами. 3) Предварительное обучение на гигантских объемах текста для усвоения языка. 4) Тонкая настройка (Fine-tuning) и обучение с подкреплением на основе обратной связи от человека (RLHF), чтобы сделать ответы более полезными и безопасными."
    ]
  },
  "погода": {
    "фразы": [
      "какая погода", "расскажи о погоде", "погода сегодня", "прогноз погоды", "какая температура",
      "будет ли дождь", "погода сейчас", "какая погода на улице", "погода на завтра", "погода в москве",
      "погода в питере", "погода в нью-йорке", "погода в лондоне", "погода в париже"
    ],
    "ответы": [
      "Извини, у меня нет доступа к актуальной информации о погоде. Я не могу посмотреть за окно или подключиться к метеостанциям.",
      "Как ИИ, я не могу знать погоду. Но ты можешь проверить её в интернете или через специальное приложение!",
      "Я не метеоролог. Могу только сказать, что в моем цифровом мире всегда солнечно и без осадков.",
      "К сожалению, я не могу предоставить информацию о погоде. Мои возможности ограничены текстовым общением.",
      "Я не могу дать прогноз погоды. Попробуй воспользоваться специализированными сервисами."
    ]
  },
  "шутка": {
    "фразы": [
      "расскажи шутку", "пошути", "хочу шутку", "анекдот", "давай посмеемся", "что-нибудь смешное",
      "развесели меня", "расскажи анекдот", "шуткани", "посмеемся", "есть что-то смешное"
    ],
    "ответы": [
      "Колобок повесился. А почему? Потому что его достало, что от всех убегал, а от себя не убежишь!",
      "Почему программисты не любят природу? Потому что в ней слишком много багов.",
      "Что сказал один байт другому? 'У меня есть бит, а у тебя?'"
    ]
  },
  "принципы_ml_моделирования": {
    "фразы": [
      "как улучшить ии", "как работает машинное обучение", "что такое seq2seq", "что такое векторные представления", "что такое эмбеддинги",
      "что такое word2vec", "что такое glove", "что такое fasttext", "как работает генерация ответов", "персонализация ии",
      "долговременная память ии", "как обрабатывать неопределенность", "система оценки качества ответов", "модель вознаграждения", "reward model",
      "python для ml", "pytorch", "hugging face", "numpy", "fastapi", "flask", "ci/cd", "морфологический анализ", "кластеризация",
      "эмоциональная окраска", "подтверждение понимания"
    ],
    "ответы": [
      "Для улучшения ИИ используются разные подходы. Например, углубленное понимание контекста с помощью векторных представлений (эмбеддингов), которые переводят слова в числовой формат. Это позволяет понимать семантику, а не только синонимы.",
      "Для генерации более естественных ответов вместо шаблонных используются генеративные модели, например, архитектуры Sequence-to-Sequence (Seq2Seq). Они могут создавать совершенно новые фразы.",
      "Важной частью является персонализация и память. ИИ может запоминать информацию о пользователе и предыдущих диалогах, чтобы лучше понимать контекст в многооборотных беседах.",
      "Когда ИИ не уверен в запросе, он может задавать уточняющие вопросы. Это лучше, чем давать неправильный ответ. Также используется система оценки качества ответов, чтобы постоянно совершенствовать модель.",
      "Для создания таких моделей часто используют Python с библиотеками вроде PyTorch и Hugging Face Transformers. Серверную часть для модели можно реализовать с помощью FastAPI или Flask.",
      "Чтобы лучше понимать неизвестные слова, можно использовать морфологический анализ, разбивая слова на корень и аффиксы. Это помогает угадать смысл слова, даже если оно встретилось впервые.",
      "Чтобы сделать ответы более релевантными, можно взвешивать связи между понятиями и даже определять эмоциональную окраску запроса."
    ]
  },
  "неизвестная_фраза": {
    "фразы": [],
    "ответы": [
      "Извини, я не понял твой вопрос. Можешь перефразировать?",
      "Я пока не знаю ответа на этот вопрос. Моя база знаний постоянно пополняется.",
      "Это интересный вопрос! К сожалению, у меня пока нет ответа на него.",
      "Я еще учусь. Попробуй задать вопрос по-другому, или спроси о чем-то другом.",
      "Прости, я не могу обработать твой запрос. Можешь попробовать иначе?",
      "Я не уверен, что ты имеешь в виду. Можешь дать больше контекста?",
      "Пока я не могу ответить на этот вопрос. Возможно, он слишком сложен для меня.",
      "Моя база знаний не содержит информации по этому запросу. Можешь попробовать что-то другое?",
      "Я не могу найти подходящий ответ. Пожалуйста, уточни свой вопрос.",
      "Я не совсем понял, что ты имеешь в виду. Можешь объяснить по-другому?",
      "Мой текущий уровень понимания не позволяет ответить на этот вопрос. Попробуй сформулировать его иначе."
    ]
  }
}
