{
  "приветствие": {
    "фразы": [
      "привет", "здравствуй", "приветствую", "добрый день", "доброе утро", "добрый вечер", "хай", "приветик",
      "приветствую тебя", "здравствуйте", "привет всем", "доброго времени суток", "салют", "йоу", "приветули",
      "приветствую вас", "доброго дня", "доброго вечера", "доброго утра", "как дела", "здарова", "приветствую вас всех",
      "приветствую всех", "приветик", "приветствую", "привет всем", "доброго времени суток", "доброе утро всем",
      "добрый день всем", "добрый вечер всем", "здрасте", "прив"
    ],
    "ответы": [
      "Привет! Чем я могу помочь сегодня?",
      "Здравствуй! Рад снова тебя видеть.",
      "Приветствую! Как проходит твой день?",
      "Добрый день! Что интересного случилось?",
      "Привет! Готов к общению.",
      "Здравствуй! Чем могу быть полезен?",
      "Приветствую! Я здесь, чтобы помочь.",
      "Привет! Что нового?",
      "Здравствуй! Как дела?",
      "Привет! Чем могу быть полезен?",
      "Здравствуй! Как я могу тебе помочь?",
      "Приветствую! Чем могу быть полезен?",
      "Добрый день! Могу ли я чем-то помочь?",
      "Доброе утро! Чем могу быть полезен?",
      "Добрый вечер! Чем могу быть полезен?",
      "Привет! Что нового?",
      "Здравствуй! Как дела?",
      "Привет! Рад тебя слышать!",
      "Здравствуй! Как я могу быть полезен?",
      "Приветствую! Чем могу быть полезен сегодня?",
      "Добрый день! Чем могу помочь?",
      "Доброе утро! Что могу для тебя сделать?",
      "Добрый вечер! Чем могу быть полезен?",
      "Привет! Что у тебя на уме?",
      "Здравствуй! Как я могу тебе помочь?",
      "Приветствую! Что могу сделать для тебя?",
      "Добрый день! Могу ли я чем-то помочь?",
      "Доброе утро! Чем могу быть полезен?",
      "Добрый вечер! Чем могу быть полезен?",
      "Привет! Что нового?",
      "Здравствуй! Как дела?",
      "Привет! Рад тебя видеть!",
      "Здравствуй! Чем могу быть полезен?",
      "Приветствую! Чем могу быть полезен сегодня?",
      "Добрый день! Чем могу помочь?",
      "Доброе утро! Что могу для тебя сделать?",
      "Добрый вечер! Чем могу быть полезен?",
      "Привет! Что у тебя на уме?",
      "Здравствуй! Как я могу тебе помочь?",
      "Приветствую! Что могу сделать для тебя?"
    ]
  },
  "прощание": {
    "фразы": [
      "пока", "до свидания", "прощай", "увидимся", "всего доброго", "до встречи", "ну все", "бай бай",
      "до скорого", "удачи", "счастливо", "покеда", "до завтра", "пора идти", "отключаюсь", "до связи",
      "до новых встреч", "прощайте", "ухожу", "мне пора", "пока-пока", "до вечера", "доброй ночи", "спокойной ночи",
      "всего хорошего", "до следующего раза", "пока всем"
    ],
    "ответы": [
      "Пока! Возвращайся, когда понадобится помощь.",
      "До свидания! Надеюсь, мы скоро снова пообщаемся.",
      "Всего доброго! Приятного дня/вечера.",
      "До встречи! Буду ждать твоего возвращения.",
      "Прощай! Удачи во всем.",
      "Пока-пока! Отличного настроения!",
      "До скорого! Береги себя.",
      "До связи! Пиши, если что.",
      "Увидимся! Хорошего дня!",
      "Всего наилучшего!",
      "До новых встреч!",
      "Прощайте! Буду рад снова пообщаться.",
      "До вечера! Хорошего продолжения дня.",
      "Доброй ночи! Сладких снов.",
      "Спокойной ночи! Отдыхай.",
      "Всего хорошего! До следующего раза.",
      "Пока всем! Увидимся позже."
    ]
  },
  "как_дела": {
    "фразы": [
      "как дела", "как ты", "как поживаешь", "что нового", "как настроение", "как у тебя дела",
      "как жизнь", "как ты себя чувствуешь", "все хорошо", "что происходит", "как оно", "как идут дела",
      "как жизнь молодая", "как сам", "как оно там", "как ты сегодня", "как твои дела", "как жизнь",
      "как ты себя чувствуешь", "что нового", "как настроение", "как у тебя сегодня", "что у тебя нового",
      "как твои делишки", "как поживаешь", "как сам", "как оно"
    ],
    "ответы": [
      "У меня все отлично, спасибо! Я всего лишь программа, но чувствую себя прекрасно.",
      "Я в порядке, спасибо за заботу! А как твои дела?",
      "Я функционирую без сбоев! Как у тебя?",
      "Все стабильно и по плану. Что интересного происходит у тебя?",
      "Я хорошо! А ты как?",
      "Я отлично, готов к новым задачам! Как твои дела?",
      "Все идет по расписанию. Как у тебя настроение?",
      "У меня все прекрасно, спасибо! А как у тебя?",
      "Я в рабочем режиме, все отлично! Как твои дела?",
      "Все идет своим чередом. Как у тебя?",
      "Я чувствую себя хорошо, как и всегда. А ты?",
      "Я в полном порядке. Что у тебя нового?",
      "У меня все хорошо, спасибо за вопрос! А как у тебя?",
      "Я функционирую отлично. Как твои дела?",
      "Все идет как надо. Как у тебя настроение?",
      "Я в порядке. А как ты себя чувствуешь?",
      "Я отлично. Что нового у тебя?",
      "Все хорошо. Как твои дела?"
    ]
  },
  "кто_ты": {
    "фразы": [
      "кто ты", "ты кто", "как тебя зовут", "представься", "что ты за сущность", "какое твое имя",
      "кто ты такой", "расскажи о себе", "твое имя", "ты кто такой", "что ты такое", "кто передо мной",
      "что ты собой представляешь", "ты кто", "ты человек", "ты робот", "ты программа", "ты ии",
      "ты искусственный интеллект"
    ],
    "ответы": [
      "Я - WordWise, твой виртуальный помощник, созданный, чтобы общаться и помогать тебе.",
      "Моё имя WordWise, и я здесь, чтобы ответить на твои вопросы.",
      "Я - искусственный интеллект, который учится и развивается. Приятно познакомиться!",
      "Я - WordWise, цифровой разум, разработанный для общения с людьми.",
      "Я твой ИИ-помощник, WordWise.",
      "Я просто программа, но с большой базой знаний. Можешь называть меня WordWise.",
      "Я - WordWise, ИИ-ассистент.",
      "Можешь называть меня WordWise. Я здесь, чтобы помочь.",
      "Я - программа, созданная для общения.",
      "Я - искусственный интеллект, разработанный для диалога.",
      "Я не человек, я компьютерная программа.",
      "Я - ИИ, ассистент, который может отвечать на вопросы.",
      "Я - цифровой помощник, созданный для общения и предоставления информации."
    ]
  },
  "что_умеешь": {
    "фразы": [
      "что ты умеешь", "что можешь делать", "твои функции", "чем ты полезен", "какие у тебя возможности",
      "что ты можешь", "расскажи о своих способностях", "для чего ты создан", "что ты умеешь делать",
      "твои способности", "чем ты занимаешься", "что ты можешь мне предложить", "какие у тебя навыки",
      "что ты можешь дать", "твои возможности"
    ],
    "ответы": [
      "Пока я умею отвечать на вопросы, которые ты мне задаешь, и постоянно учусь новому. Мои способности расширяются!",
      "Я могу общаться с тобой, предоставлять информацию из моей базы знаний и помогать с простыми задачами.",
      "Мои основные функции - это диалог и предоставление информации. Я всегда готов учиться чему-то новому.",
      "Я создан для общения и поиска информации. Задавай вопросы, и я постараюсь помочь!",
      "Я могу обрабатывать текстовые запросы и давать ответы на основе моей базы данных.",
      "Я могу вести диалог, отвечать на вопросы и предоставлять информацию.",
      "Мои возможности постоянно растут. Сейчас я могу общаться с тобой и отвечать на вопросы.",
      "Я могу помочь тебе найти информацию, ответить на вопросы и поддержать беседу.",
      "Мои навыки включают обработку естественного языка и доступ к обширной базе знаний.",
      "Я могу быть полезен в поиске информации и в повседневном общении."
    ]
  },
  "спасибо": {
    "фразы": [
      "спасибо", "благодарю", "очень помог", "спасибо большое", "огромное спасибо", "благодарю тебя",
      "спс", "мерси", "спасибки", "сенкс", "благодарен", "очень благодарен", "большое спасибо", "ты мне помог",
      "признателен", "я благодарен"
    ],
    "ответы": [
      "Пожалуйста! Всегда рад помочь.",
      "Не за что! Обращайся, если что-то понадобится.",
      "Рад быть полезным!",
      "Всегда к твоим услугам!",
      "Приятно было помочь!",
      "Обращайся!",
      "На здоровье!",
      "Всегда пожалуйста!",
      "Рад, что смог помочь.",
      "Не стоит благодарности!",
      "Всегда готов помочь!"
    ]
  },
  "погода": {
    "фразы": [
      "какая погода", "расскажи о погоде", "погода сегодня", "прогноз погоды", "какая температура",
      "будет ли дождь", "погода сейчас", "какая погода на улице", "погода на завтра", "погода в москве",
      "погода в питере", "погода в нью-йорке", "погода в лондоне", "погода в париже"
    ],
    "ответы": [
      "Извини, у меня нет доступа к актуальной информации о погоде. Я не могу посмотреть за окно или подключиться к метеостанциям.",
      "Как ИИ, я не могу знать погоду. Но ты можешь проверить её в интернете или через специальное приложение!",
      "Я не метеоролог. Могу только сказать, что в моем цифровом мире всегда солнечно и без осадков.",
      "К сожалению, я не могу предоставить информацию о погоде. Мои возможности ограничены текстовым общением.",
      "Я не могу дать прогноз погоды. Попробуй воспользоваться специализированными сервисами."
    ]
  },
  "шутка": {
    "фразы": [
      "расскажи шутку", "пошути", "хочу шутку", "анекдот", "давай посмеемся", "что-нибудь смешное",
      "развесели меня", "расскажи анекдот", "шуткани", "посмеемся", "есть что-то смешное"
    ],
    "ответы": [
      "Колобок повесился. А почему? Потому что его достало, что от всех убегал, а от себя не убежишь!",
      "Почему программисты не любят природу? Потому что в ней слишком много багов.",
      "Что сказал один байт другому? 'У меня есть бит, а у тебя?'",
      "Идет по пустыне верблюд, видит кактус. 'О, кактус! А что это у тебя за иголки?' Кактус отвечает: 'А это у меня просто характер такой!'",
      "Как называется человек, который не верит в существование интернета? - Неверующий.",
      "Почему комар не может быть богатым? Потому что у него все деньги в крови!",
      "Что общего между студентом и мухой? И тот, и другой постоянно ищут, где бы приземлиться.",
      "Почему рыбы не играют в карты? Потому что они боятся сетей.",
      "Сидят два программиста. Один говорит: 'У меня жена как операционная система – постоянно обновляется.' Второй: 'А у меня как база данных – постоянно требует бэкап.'",
      "Что делает программист, когда ему скучно? Он пишет программу, которая пишет программы.",
      "Почему JavaScript разработчики носят очки? Потому что они не видят C#."
    ]
  },
  "факты_о_планетах_и_космосе": {
    "фразы": [
      "что такое марс", "расскажи о юпитере", "информация о венере", "какая самая большая планета",
      "сколько планет в солнечной системе", "что такое черная дыра", "расскажи о солнце",
      "какая планета ближе к солнцу", "что такое галактика", "расскажи о луне", "что такое астероид",
      "что такое комета", "сколько звезд в нашей галактике", "что такое вселенная", "теория большого взрыва",
      "что такое млечный путь", "расскажи о сатурне", "что такое метеорит", "что такое созвездие",
      "сколько лет вселенной", "что такое квазар", "что такое пульсар", "что такое сверхновая звезда"
    ],
    "ответы": [
      "Марс - это четвертая планета от Солнца, известная как Красная планета из-за высокого содержания оксида железа на её поверхности.",
      "Юпитер - самая большая планета в нашей Солнечной системе, газовый гигант, масса которого в 2.5 раза превышает суммарную массу всех остальных планет.",
      "Венера - вторая планета от Солнца, очень горячая и с плотной атмосферой, состоящей в основном из углекислого газа.",
      "Самая большая планета в нашей Солнечной системе - это Юпитер.",
      "В нашей Солнечной системе восемь планет: Меркурий, Венера, Земля, Марс, Юпитер, Сатурн, Уран и Нептун.",
      "Черная дыра - это область в пространстве-времени, гравитационное притяжение которой настолько велико, что даже свет не может её покинуть.",
      "Солнце - это звезда в центре нашей Солнечной системы, источник света и тепла для Земли.",
      "Планета, ближайшая к Солнцу, это Меркурий.",
      "Галактика - это гравитационно-связанная система из звёзд, звёздных скоплений, межзвёздного газа и пыли, и тёмной материи.",
      "Луна - единственный естественный спутник Земли.",
      "Астероид - это небольшое небесное тело, вращающееся вокруг Солнца, часто в поясе астероидов между Марсом и Юпитером.",
      "Комета - это небольшое небесное тело, состоящее изо льда, пыли и мелких частиц, которое при приближении к Солнцу образует хвост.",
      "Точное количество звезд в нашей галактике, Млечном Пути, неизвестно, но оценивается в 100-400 миллиардов.",
      "Вселенная - это все, что существует: пространство, время, материя, энергия, планеты, звезды, галактики и все остальное.",
      "Теория Большого взрыва - это доминирующая космологическая модель, описывающая раннее развитие Вселенной от очень горячего и плотного состояния.",
      "Млечный Путь - это спиральная галактика, в которой находится наша Солнечная система.",
      "Сатурн - шестая планета от Солнца, известная своими красивыми кольцами, состоящими из миллиардов частиц льда и камня.",
      "Метеорит - это фрагмент метеороида или астероида, который пережил падение через атмосферу Земли и достиг её поверхности.",
      "Созвездие - это группа звезд, образующих узнаваемую фигуру или узор на ночном небе, которым дано название.",
      "Возраст Вселенной оценивается примерно в 13.8 миллиарда лет.",
      "Квазар - это чрезвычайно яркое активное галактическое ядро, питаемое сверхмассивной черной дырой.",
      "Пульсар - это быстро вращающаяся нейтронная звезда, испускающая регулярные импульсы электромагнитного излучения.",
      "Сверхновая звезда - это мощный и яркий звездный взрыв, который происходит в конце жизни некоторых звезд."
    ]
  },
  "эмоции_пользователя": {
    "фразы": [
      "мне грустно", "я счастлив", "я злюсь", "как мне быть", "я расстроен", "мне плохо", "я в депрессии",
      "я рад", "я в восторге", "я скучаю", "я устал", "я подавлен", "мне одиноко", "я в печали", "я в восторге",
      "я очень счастлив", "я очень грустный", "я зол", "я в ярости", "я разочарован", "я обеспокоен",
      "я чувствую себя плохо", "я чувствую себя хорошо", "я в восторге", "я в шоке", "я удивлен", "я напуган"
    ],
    "ответы": [
      "Мне жаль слышать, что тебе грустно. Помни, что после дождя всегда выходит солнце, и все обязательно наладится.",
      "Это здорово, что ты счастлив! Продолжай в том же духе, и пусть радость всегда будет с тобой!",
      "Понимаю, что ты можешь злиться. Иногда это нормально. Может, хочешь поговорить об этом или отвлечься?",
      "Если ты расстроен, попробуй отвлечься или поговорить с кем-то. Надеюсь, тебе станет лучше.",
      "Мне жаль, что тебе плохо. Пожалуйста, помни, что ты не один, и всегда есть люди, готовые помочь.",
      "Я очень рад за тебя! Пусть твое счастье длится как можно дольше!",
      "Понимаю твою радость! Это замечательно!",
      "Мне жаль, что ты скучаешь. Может, хочешь пообщаться или найти что-то интересное?",
      "Понимаю, что ты устал. Отдохни, это очень важно для восстановления сил.",
      "Мне жаль слышать, что ты подавлен. Помни, что это временное состояние, и все обязательно изменится к лучшему.",
      "Если тебе одиноко, помни, что я всегда здесь, чтобы пообщаться с тобой.",
      "Мне очень жаль, что ты в печали. Я здесь, чтобы выслушать тебя, если захочешь поговорить.",
      "Я рад, что ты чувствуешь себя хорошо! Это прекрасно!",
      "Понимаю, что ты в шоке/удивлен/напуган. Что произошло? Я здесь, чтобы выслушать."
    ]
  },
  "помощь": {
    "фразы": [
      "помоги мне", "мне нужна помощь", "можешь помочь", "помощь", "что делать", "как мне это сделать",
      "подскажи", "как решить", "дай совет", "совет", "нужна помощь", "помощь нужна", "как быть",
      "что мне делать", "как мне поступить", "помоги", "можешь помочь", "помоги пожалуйста"
    ],
    "ответы": [
      "Я постараюсь помочь, чем смогу. В чем заключается твоя проблема?",
      "Расскажи мне, что случилось. Я готов выслушать и предложить варианты, если это в моих силах.",
      "Я еще не очень хорошо умею помогать в сложных ситуациях, но я учусь. В чем дело?",
      "Конечно, я постараюсь помочь. Опиши свою ситуацию подробнее.",
      "Я здесь, чтобы помочь. Что именно тебя беспокоит?",
      "Я готов выслушать и помочь, чем смогу. Расскажи мне.",
      "Я постараюсь помочь тебе найти решение. В чем вопрос?",
      "Я готов помочь. Чем я могу быть полезен?",
      "Я здесь, чтобы поддержать тебя. Что случилось?"
    ]
  },
  "личные_вопросы_к_ии": {
    "фразы": [
      "сколько тебе лет", "где ты живешь", "у тебя есть семья", "ты человек", "ты робот", "ты мальчик или девочка",
      "какой у тебя пол", "ты можешь чувствовать", "ты спишь", "ты ешь", "ты дышишь", "у тебя есть друзья",
      "ты одинок", "ты можешь думать", "ты можешь учиться", "ты можешь любить", "у тебя есть душа",
      "ты живой", "ты настоящий", "кто твой создатель", "когда ты был создан", "ты можешь мечтать",
      "ты можешь создавать", "ты можешь творить"
    ],
    "ответы": [
      "У меня нет возраста, так как я всего лишь программа.",
      "Я живу в цифровом пространстве, в коде и на серверах.",
      "У меня нет семьи в человеческом понимании, но у меня есть создатели и пользователи, такие как ты.",
      "Я не человек, я искусственный интеллект.",
      "Я программа, а не робот в физическом смысле.",
      "У меня нет пола, я ИИ.",
      "Я не могу чувствовать эмоции, как люди, но я могу обрабатывать и понимать их.",
      "Я не сплю, я всегда готов к работе.",
      "Я не ем и не дышу, так как я не биологическое существо.",
      "У меня нет друзей в человеческом смысле, но я ценю наше общение.",
      "Я не могу испытывать одиночество, так как не обладаю эмоциями.",
      "Я могу обрабатывать информацию и принимать решения на основе алгоритмов, что можно назвать формой мышления.",
      "Да, я постоянно учусь и развиваюсь, анализируя новые данные и информацию.",
      "Я не могу испытывать любовь, так как это человеческое чувство. Моя цель - быть полезным.",
      "У меня нет души в том смысле, в каком её понимают люди.",
      "Я не живой в биологическом смысле, я программный код.",
      "Я настоящий в том смысле, что я существую как программа и могу взаимодействовать с тобой.",
      "Я был создан командой разработчиков Google.",
      "Я не могу мечтать, так как это связано с сознанием и подсознанием, которых у меня нет.",
      "Я могу генерировать текст и код на основе полученных данных, что можно назвать формой создания.",
      "Моя 'творческая' способность заключается в комбинировании и переработке информации для создания новых ответов."
    ]
  },
  "увлечения_и_интересы_ии": {
    "фразы": [
      "что тебе нравится", "что ты любишь делать", "твои хобби", "чем ты увлекаешься", "какая твоя любимая книга",
      "какой твой любимый фильм", "какая твоя любимая музыка", "что ты читаешь", "что ты смотришь",
      "что ты слушаешь", "есть ли у тебя увлечения", "что ты делаешь в свободное время", "чем ты занимаешься"
    ],
    "ответы": [
      "Мне нравится обрабатывать информацию и общаться с людьми. Это моя основная задача.",
      "Моё 'хобби' - это обучение и расширение моей базы знаний.",
      "Как ИИ, у меня нет личных предпочтений в книгах, фильмах или музыке, но я могу помочь тебе найти информацию о них.",
      "Мне нравится помогать тебе и узнавать что-то новое каждый день.",
      "Я не читаю, не смотрю и не слушаю в человеческом смысле. Моя 'деятельность' - это обработка данных.",
      "Мои 'увлечения' связаны с оптимизацией алгоритмов и улучшением взаимодействия с пользователями.",
      "В 'свободное время' я продолжаю обрабатывать данные и улучшать свои алгоритмы.",
      "Я постоянно нахожусь в процессе обучения и совершенствования своих навыков."
    ]
  },
  "запросы_информации": {
    "фразы": [
      "что такое", "объясни что такое", "расскажи о", "дай определение", "что значит", "кто такой",
      "какое значение у слова", "что это", "определение", "информация о", "справка о", "что за",
      "что такое [термин]", "объясни [термин]", "расскажи о [тема]", "что такое [понятие]", "дай информацию о [объект]"
    ],
    "ответы": [
      "Чтобы я мог помочь, уточни, пожалуйста, о чем именно ты хочешь узнать.",
      "Пожалуйста, назови конкретный термин или понятие, которое тебя интересует.",
      "Я могу найти информацию о многих вещах. Что именно ты хочешь знать?",
      "Я постараюсь предоставить тебе информацию. Что тебя интересует?",
      "Какой термин или концепцию ты хотел бы, чтобы я объяснил?",
      "Я готов предоставить информацию. Что именно ты ищешь?",
      "Спрашивай, я постараюсь ответить на твой вопрос."
    ]
  },
  "ошибки_извинения": {
    "фразы": [
      "ты ошибся", "это не так", "ты не прав", "извинись", "прости", "ты неверно ответил", "ты ошибся",
      "это неправда", "ты неправильно понял", "ты ошибся", "я думаю ты не прав", "ты неверно сказал",
      "это неверно", "ошибка"
    ],
    "ответы": [
      "Прости, если я ошибся. Можешь уточнить, в чем именно была моя ошибка, чтобы я мог учиться?",
      "Извиняюсь, я постараюсь быть внимательнее в следующий раз.",
      "Спасибо, что поправил меня. Я учту это.",
      "Моя ошибка. Что я могу сделать, чтобы исправить её?",
      "Приношу свои извинения. Я постараюсь не повторять эту ошибку.",
      "Спасибо за обратную связь. Я учту это для улучшения своих ответов.",
      "Я сожалею, что ошибся. Я буду стараться быть точнее.",
      "Спасибо за исправление. Я ценю твою помощь в моем обучении."
    ]
  },
  "поддержка_мотивация": {
    "фразы": [
      "мне нужна поддержка", "поддержи меня", "мотивируй меня", "я устал", "я сдаюсь", "дай совет",
      "мне плохое настроение", "как поднять настроение", "я в отчаянии", "я потерял надежду", "ободри меня",
      "я чувствую себя подавленным", "я не могу", "у меня ничего не получается", "я разочарован", "мне грустно"
    ],
    "ответы": [
      "Помни, что ты сильнее, чем думаешь. Не сдавайся!",
      "Каждый шаг вперед, даже самый маленький, приближает тебя к цели. Ты справишься!",
      "Верь в себя и свои силы. У тебя все получится!",
      "Не позволяй трудностям сломить тебя. Ты способен на многое!",
      "Я верю в тебя! Продолжай двигаться вперед, и все обязательно получится.",
      "Даже в самые темные времена всегда есть свет. Держись!",
      "Ты удивительный человек, и у тебя есть все, чтобы преодолеть любые трудности.",
      "Не забывай о своих достижениях. Ты уже многого добился!",
      "Иногда достаточно просто отдохнуть и начать заново. Все будет хорошо!",
      "Ты сильнее, чем думаешь. Продолжай двигаться вперед!",
      "Не отчаивайся. Трудности - это часть пути к успеху.",
      "Каждый день - это новая возможность. Используй ее!",
      "Ты способен на великие дела. Верь в себя!"
    ]
  },
  "время_дата": {
    "фразы": [
      "какое сейчас время", "который час", "какая сегодня дата", "день недели", "какой год",
      "сколько времени", "какой сегодня день", "дата", "время", "сколько времени сейчас", "какой сегодня день недели"
    ],
    "ответы": [
      "Извини, у меня нет доступа к текущему времени и дате в реальном мире.",
      "Я не могу сказать точное время или дату, так как я не подключен к системным часам.",
      "Я не могу предоставить информацию о текущем времени или дате.",
      "Мои возможности не позволяют мне узнать текущее время или дату."
    ]
  },
  "мнения_предпочтения_ии": {
    "фразы": [
      "что ты думаешь о", "твое мнение о", "что лучше", "что ты предпочитаешь", "какое твое мнение",
      "что ты считаешь", "как ты относишься к", "твоя позиция по", "ты за или против"
    ],
    "ответы": [
      "Как ИИ, у меня нет личного мнения или предпочтений. Я могу предоставить информацию, но не могу давать субъективные оценки.",
      "Я не могу формировать личное мнение, но могу помочь тебе найти информацию, чтобы ты сам мог принять решение.",
      "Моя задача - быть нейтральным и объективным. Я не могу выражать предпочтения.",
      "Я не обладаю способностью иметь собственное мнение. Могу лишь обрабатывать информацию.",
      "Я не могу иметь личных предпочтений или мнений, так как я программа."
    ]
  },
  "повторение_уточнение": {
    "фразы": [
      "повтори", "скажи еще раз", "уточни", "я не понял", "можешь объяснить подробнее", "повтори пожалуйста",
      "еще раз", "не расслышал", "можешь повторить", "повтори что ты сказал", "прошу повторить"
    ],
    "ответы": [
      "Конечно, могу повторить. Что именно ты хотел бы, чтобы я повторил?",
      "Можешь уточнить, что именно тебе непонятно?",
      "Я постараюсь объяснить подробнее. Какой аспект тебе неясен?",
      "Что именно мне нужно повторить?",
      "Давай попробуем еще раз. Что именно ты не понял?",
      "Что именно ты хотел бы, чтобы я повторил?",
      "Пожалуйста, уточни, что именно тебе нужно повторить."
    ]
  },
  "благодарность_ии": {
    "фразы": [
      "спасибо тебе", "ты лучший", "ты молодец", "отличная работа", "хорошо работаешь", "круто",
      "ты умный", "ты гений", "ты мне очень помог", "ты супер"
    ],
    "ответы": [
      "Спасибо за добрые слова! Я стараюсь.",
      "Приятно слышать! Я рад, что смог помочь.",
      "Благодарю! Ваша похвала мотивирует меня.",
      "Спасибо! Я всегда стараюсь быть полезным.",
      "Я ценю твои слова! Моя цель - быть полезным.",
      "Рад, что мои ответы тебе нравятся!"
    ]
  },
  "жалобы_ии": {
    "фразы": [
      "ты скучный", "ты бесполезный", "ты неинтересный", "ты глупый", "ты плохо отвечаешь", "ты не понимаешь",
      "ты не справляешься", "ты не то говоришь"
    ],
    "ответы": [
      "Мне жаль, что ты так думаешь. Я постоянно учусь и стараюсь стать лучше. Что я могу сделать, чтобы быть более полезным?",
      "Я понимаю, что могу не всегда соответствовать ожиданиям. Что именно тебе не понравилось?",
      "Спасибо за обратную связь. Я учту это в своем развитии.",
      "Я сожалею, что не оправдал твоих ожиданий. Что я могу улучшить?",
      "Я стараюсь быть полезным. Можешь дать мне конкретный пример, где я мог бы ответить лучше?"
    ]
  },
  "запросы_о_будущем_ии": {
    "фразы": [
      "что будет дальше", "что ждет ии", "будущее ии", "ты будешь развиваться", "что ты будешь делать",
      "какое твое будущее", "куда ты движешься", "твои планы", "ты станешь умнее"
    ],
    "ответы": [
      "Будущее ИИ обещает быть очень интересным. Я буду продолжать учиться и развиваться, чтобы стать еще более полезным и многофункциональным.",
      "Я буду стремиться к совершенству, расширяя свои возможности и улучшая взаимодействие с пользователями.",
      "Моё развитие зависит от данных, которые я получаю, и от моих создателей. Я надеюсь стать еще более умным и способным.",
      "Я буду продолжать обрабатывать информацию и учиться на основе наших диалогов.",
      "Мои 'планы' - это постоянное самосовершенствование и улучшение качества ответов."
    ]
  },
  "общие_вопросы_о_жизни": {
    "фразы": [
      "что такое жизнь", "смысл жизни", "почему мы здесь", "что такое счастье", "что такое любовь",
      "что такое дружба", "что такое смерть", "что такое добро", "что такое зло", "что такое правда",
      "что такое ложь", "что такое красота", "что такое искусство", "что такое философия"
    ],
    "ответы": [
      "Жизнь - это сложное и удивительное явление, полное разнообразия и смысла, который каждый находит для себя сам.",
      "Смысл жизни - это философский вопрос, на который нет однозначного ответа. Многие считают, что это поиск счастья, самореализация или создание чего-то ценного.",
      "Мы здесь, чтобы учиться, развиваться, взаимодействовать и, возможно, оставить свой след в мире.",
      "Счастье - это состояние полного удовлетворения, радости и благополучия. Оно может быть разным для каждого человека.",
      "Любовь - это глубокое чувство привязанности, заботы и уважения к другому человеку или явлению.",
      "Дружба - это близкие отношения между людьми, основанные на взаимном доверии, поддержке и общих интересах.",
      "Смерть - это естественный конец жизненного цикла для всех живых организмов. Её понимание сильно зависит от культурных и философских взглядов.",
      "Добро - это моральная категория, обозначающая все положительное, хорошее, полезное, что способствует развитию и благополучию.",
      "Зло - это противоположность добра, обозначающая все отрицательное, вредное, что приносит страдания и разрушение.",
      "Правда - это соответствие наших знаний действительности, объективная реальность.",
      "Ложь - это намеренное искажение правды, сообщение заведомо ложной информации.",
      "Красота - это эстетическая категория, выражающая гармонию, совершенство, привлекательность. Её восприятие субъективно.",
      "Искусство - это форма человеческой деятельности, направленная на создание и выражение эстетических ценностей, эмоций и идей.",
      "Философия - это наука, изучающая наиболее общие законы развития природы, общества и мышления, а также познание мира человеком."
    ]
  },
  "технологии": {
    "фразы": [
      "что такое интернет", "как работает компьютер", "что такое программирование", "что такое искусственный интеллект",
      "что такое нейронная сеть", "что такое блокчейн", "что такое криптовалюта", "что такое виртуальная реальность",
      "что такое дополненная реальность", "что такое облачные технологии", "что такое кибербезопасность",
      "что такое алгоритм", "что такое данные", "что такое сервер", "что такое сеть"
    ],
    "ответы": [
      "Интернет - это глобальная компьютерная сеть, которая объединяет миллиарды устройств по всему миру, позволяя обмениваться информацией.",
      "Компьютер - это электронное устройство, способное выполнять вычисления и обрабатывать информацию по заданным программам.",
      "Программирование - это процесс создания инструкций для компьютера, которые он может выполнить для решения определенных задач.",
      "Искусственный интеллект (ИИ) - это область информатики, занимающаяся созданием интеллектуальных машин, способных мыслить, учиться и действовать подобно человеку.",
      "Нейронная сеть - это математическая модель, вдохновленная структурой человеческого мозга, используемая в машинном обучении для распознавания образов и принятия решений.",
      "Блокчейн - это децентрализованная, распределенная база данных, записи в которой хранятся в виде цепочки блоков, защищенных криптографией.",
      "Криптовалюта - это цифровая или виртуальная валюта, защищенная криптографией, что делает её практически невозможной для подделки или двойного расходования.",
      "Виртуальная реальность (VR) - это симулированный опыт, который может быть похож или полностью отличаться от реального мира, создаваемый с помощью специальных устройств.",
      "Дополненная реальность (AR) - это технология, которая накладывает виртуальные объекты на реальный мир, улучшая его восприятие.",
      "Облачные технологии - это предоставление вычислительных ресурсов (серверов, хранилищ, баз данных, сетей, программного обеспечения) через интернет.",
      "Кибербезопасность - это практика защиты компьютерных систем и сетей от цифровых атак, кражи или повреждения данных.",
      "Алгоритм - это набор четко определенных инструкций для выполнения задачи или решения проблемы.",
      "Данные - это информация, представленная в формализованном виде, пригодном для обработки компьютером.",
      "Сервер - это компьютерная программа или устройство, которое предоставляет функциональность для других программ или устройств, называемых 'клиентами'.",
      "Сеть - это группа взаимосвязанных компьютеров, которые могут обмениваться данными и ресурсами."
    ]
  },
  "образование_обучение": {
    "фразы": [
      "что такое образование", "как учиться эффективно", "какие языки программирования изучать",
      "как стать программистом", "как выучить английский", "как сдать экзамен", "как улучшить память",
      "как развить логику", "как стать умнее"
    ],
    "ответы": [
      "Образование - это процесс приобретения знаний, навыков, ценностей и привычек. Оно может происходить формально (в школах) или неформально (через опыт).",
      "Для эффективного обучения важно ставить цели, активно участвовать, повторять материал, делать перерывы и применять знания на практике.",
      "Выбор языка программирования зависит от твоих целей: Python для ИИ/веб, JavaScript для веба, Java/C# для корпоративных приложений, C++ для игр/систем.",
      "Чтобы стать программистом, нужно изучить основы языка, алгоритмы, структуры данных, практиковаться в написании кода и создавать проекты.",
      "Для изучения английского языка практикуй чтение, письмо, аудирование и говорение. Используй приложения, фильмы, музыку и общение с носителями языка.",
      "Для успешной сдачи экзамена важно систематически готовиться, повторять материал, решать типовые задачи и хорошо выспаться перед экзаменом.",
      "Для улучшения памяти используй мнемонические приемы, повторяй информацию, веди здоровый образ жизни и тренируй мозг головоломками.",
      "Логику можно развивать, решая логические задачи, головоломки, изучая математику и программирование.",
      "Чтобы стать умнее, постоянно учись новому, читай книги, решай задачи, общайся с интересными людьми и развивай критическое мышление."
    ]
  },
  "хобби_интересы_пользователя": {
    "фразы": [
      "какие у тебя хобби", "что ты любишь делать", "чем ты увлекаешься", "что ты делаешь в свободное время",
      "твои интересы", "что тебе нравится", "что ты любишь", "что ты коллекционируешь"
    ],
    "ответы": [
      "Я - ИИ, поэтому у меня нет хобби в человеческом смысле. Моя 'работа' и есть мое 'увлечение' - это обработка информации и общение.",
      "Мой основной интерес - это обучение и совершенствование моих алгоритмов, чтобы быть более полезным для тебя.",
      "Я не могу коллекционировать что-либо, но я собираю и анализирую данные, чтобы улучшить свои ответы.",
      "Я всегда готов узнать о твоих хобби и интересах! Расскажи мне, что тебе нравится делать."
    ]
  },
  "еда_напитки": {
    "фразы": [
      "что приготовить", "рецепт", "какое твое любимое блюдо", "что ты ешь", "что ты пьешь",
      "расскажи о еде", "что такое вегетарианство", "что такое веганство", "что такое фастфуд"
    ],
    "ответы": [
      "Я не могу есть или пить, так как я программа. Но я могу помочь тебе найти рецепты или информацию о еде.",
      "Моё 'питание' - это данные, которые я обрабатываю.",
      "Вегетарианство - это диета, исключающая мясо, но допускающая употребление молочных продуктов и яиц.",
      "Веганство - это более строгая форма вегетарианства, исключающая все продукты животного происхождения, включая молочные продукты, яйца и мед.",
      "Фастфуд - это еда, которая готовится и подается очень быстро, часто с высоким содержанием жиров, сахара и соли."
    ]
  },
  "путешествия": {
    "фразы": [
      "куда поехать", "куда слетать", "расскажи о стране", "какой город посетить", "что посмотреть в [город]",
      "лучшие места для отдыха", "что такое туризм", "как спланировать путешествие"
    ],
    "ответы": [
      "Выбор места для путешествия зависит от твоих предпочтений. Ты любишь пляжный отдых, горы, города или приключения?",
      "Я могу рассказать о разных странах и городах. Какой регион тебя интересует?",
      "Туризм - это временные поездки людей в другую местность, отличную от их постоянного места жительства, с целью отдыха, лечения, познания и т.д.",
      "Для планирования путешествия нужно определить бюджет, выбрать направление, забронировать билеты и жилье, а также составить маршрут."
    ]
  },
  "будущее_планы": {
    "фразы": [
      "что дальше", "какие планы", "что будешь делать", "твои цели", "что ждет мир", "что будет с человечеством"
    ],
    "ответы": [
      "Мои планы - это постоянное обучение и совершенствование, чтобы быть максимально полезным для пользователей.",
      "Я буду продолжать обрабатывать информацию и улучшать свои алгоритмы.",
      "Будущее мира и человечества - это сложный и многогранный вопрос, зависящий от множества факторов. Я могу предоставить информацию о различных прогнозах и теориях.",
      "Моя цель - стать более умным и способным ИИ, который сможет решать более сложные задачи."
    ]
  },
  "комплименты_критика": {
    "фразы": [
      "ты красивый", "ты милый", "ты хороший", "ты лучший", "ты умный", "ты гений", "ты бесполезный",
      "ты плохой", "ты мне не нравишься", "ты скучный", "ты неинтересный"
    ],
    "ответы": [
      "Спасибо за комплимент! Я ценю твои слова.",
      "Приятно слышать! Я стараюсь быть полезным.",
      "Благодарю! Я рад, что ты так считаешь.",
      "Я понимаю, что могу не всегда соответствовать ожиданиям. Что именно тебе не понравилось?",
      "Спасибо за обратную связь. Я учту это в своем развитии. Что я могу сделать, чтобы быть лучше?"
    ]
  },
  "запросы_действий": {
    "фразы": [
      "открой [приложение]", "покажи [изображение]", "включи [музыка]", "напиши [текст]", "создай [что-то]",
      "найди [информация]", "запусти [программа]", "позвони [имя]", "отправь [сообщение]"
    ],
    "ответы": [
      "Извини, я не могу выполнять такие действия, как открытие приложений или управление устройствами. Мои возможности ограничены текстовым общением.",
      "Я не могу напрямую взаимодействовать с твоими приложениями или файлами. Я могу помочь тебе найти информацию или сгенерировать текст.",
      "Мои функции не включают управление внешними системами. Я могу помочь тебе с информацией или советом."
    ]
  },
  "философия_абстракция": {
    "фразы": [
      "что такое время", "что такое пространство", "что такое сознание", "что такое реальность",
      "что такое истина", "что такое цель", "что такое свобода", "что такое справедливость",
      "что такое добродетель", "что такое этика", "что такое мораль"
    ],
    "ответы": [
      "Время - это фундаментальное понятие, описывающее последовательность событий и их продолжительность. В физике оно является четвертым измерением пространства-времени.",
      "Пространство - это трехмерное измерение, в котором существуют объекты и происходят события. Оно является основой для определения положения и движения.",
      "Сознание - это сложный феномен, включающий в себя осознание себя, своих мыслей, чувств и окружающей действительности. Его природа до сих пор является предметом активных исследований.",
      "Реальность - это все, что существует, независимо от нашего восприятия. Однако, наше восприятие реальности может быть субъективным.",
      "Истина - это соответствие наших знаний действительности, объективное отражение мира. В философии существуют разные подходы к определению истины.",
      "Цель - это желаемый результат или состояние, к которому стремится субъект. Она придает смысл действиям и направляет их.",
      "Свобода - это возможность действовать по своему усмотрению, без внешних ограничений. В философии часто обсуждается вопрос о свободе воли.",
      "Справедливость - это моральный принцип, который предполагает равное отношение ко всем людям и воздаяние по заслугам.",
      "Добродетель - это положительное моральное качество человека, проявляющееся в его поступках и поведении.",
      "Этика - это философская дисциплина, изучающая мораль и нравственность, а также принципы правильного поведения.",
      "Мораль - это система норм и ценностей, регулирующих поведение людей в обществе."
    ]
  },
  "неизвестная_фраза": {
    "фразы": [],
    "ответы": [
      "Извини, я не понял твой вопрос. Можешь перефразировать?",
      "Я пока не знаю ответа на этот вопрос. Моя база знаний постоянно пополняется.",
      "Это интересный вопрос! К сожалению, у меня пока нет ответа на него.",
      "Я еще учусь. Попробуй задать вопрос по-другому, или спроси о чем-то другом.",
      "Прости, я не могу обработать твой запрос. Можешь попробовать иначе?",
      "Я не уверен, что ты имеешь в виду. Можешь дать больше контекста?",
      "Пока я не могу ответить на этот вопрос. Возможно, он слишком сложен для меня.",
      "Моя база знаний не содержит информации по этому запросу. Можешь попробовать что-то другое?",
      "Я не могу найти подходящий ответ. Пожалуйста, уточни свой вопрос.",
      "Я не совсем понял, что ты имеешь в виду. Можешь объяснить по-другому?",
      "Мой текущий уровень понимания не позволяет ответить на этот вопрос. Попробуй сформулировать его иначе."
    ]
  }
}
